PKS1C/src/InformationRegisters/ПочасовыеРаботы/ПочасовыеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПочасовыеРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Удаленка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сверхурочка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВремяЗатраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СоставРабот</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ВремяПрибытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкиКлиентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PKS1C/src/InformationRegisters/ДоговораОбслуживания/ДоговораОбслуживания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДоговораОбслуживания</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>АбонентскаяПлата</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифСверхурочный</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЧерныйСписок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PKS1C/src/InformationRegisters/ГрафикДежурств/ГрафикДежурств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГрафикДежурств</name>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Сверхурочка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PKS1C/src/Enums/СтатусыДоговоровОбслуживания/СтатусыДоговоровОбслуживания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДоговоровОбслуживания</name>
  <enumValues>
    <name>Действующий</name>
  </enumValues>
  <enumValues>
    <name>Недействующий</name>
  </enumValues>
  <enumValues>
    <name>ЧерныйСписок</name>
  </enumValues>
</mdclass:Enum>

PKS1C/src/CommonModules/АутсорсРаботы/Module.bsl
//Возвращает список клиентов (контрагентов), с которыми велись работы
Функция ОбслуживащиесяКонтрагентыЗаПериод(ДатаНачала,ДатаОкончания) Экспорт
	СписокКонтрагентов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПочасовыеРаботы.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.ПочасовыеРаботы КАК ПочасовыеРаботы
		|ГДЕ
		|	ПочасовыеРаботы.Период МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокКонтрагентов.Добавить(ВыборкаДетальныеЗаписи.Организация);
	КонецЦикла;
	
	Возврат СписокКонтрагентов;
КонецФункции

//ИСТИНА, если после указанной даты для контрагента существует новый договор
Функция ЕстьНовыйДоговор(Контрагент,Дата) Экспорт	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	1 КАК Запись
		|ИЗ
		|	РегистрСведений.ДоговораОбслуживания.СрезПоследних(
		|			,
		|			Контрагент = &Контрагент
		|				И Период > &Период) КАК ДоговораОбслуживанияСрезПоследних";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Период", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции

//Получить статус договора
Функция СтатусДоговора(ДокументДоговора) Экспорт
	Если ДокументДоговора.ЧерныйСписок Тогда
		Статус = Перечисления.СтатусыДоговоровОбслуживания.ЧерныйСписок;
	ИначеЕсли Не ЕстьНовыйДоговор(ДокументДоговора.Контрагент,ДокументДоговора.Дата) И (ДокументДоговора.СрокДействия > НачалоДня(ТекущаяДата()) Или Не ЗначениеЗаполнено(ДокументДоговора.СрокДействия)) Тогда
		Статус = Перечисления.СтатусыДоговоровОбслуживания.Действующий;
	Иначе
		Статус = Перечисления.СтатусыДоговоровОбслуживания.Недействующий;
	КонецЕсли;
	
	Возврат Статус;
КонецФункции

//Получить статус обслуживани клиента
Функция СтатусОбслуживания(Знач Контрагент,Дата=Неопределено) Экспорт
	Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.Клиенты") Тогда 
		Контрагент = Контрагент.Контрагент;
	КонецЕсли;
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговораОбслуживанияСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ДоговораОбслуживания.СрезПоследних(&Дата, Контрагент = &Контрагент) КАК ДоговораОбслуживанияСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Контрагент", Контрагент); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Статус = СтатусДоговора(ВыборкаДетальныеЗаписи.Регистратор);
	Иначе
		Статус = Перечисления.СтатусыДоговоровОбслуживания.Недействующий;
	КонецЕсли;

	Возврат Статус;
КонецФункции

//Получить дежурного на выбранную дату
Функция ПолучитьДежурного(Дата) Экспорт
	ГрафикДежурствМенеджер = РегистрыСведений.ГрафикДежурств.СоздатьМенеджерЗаписи();
	ГрафикДежурствМенеджер.Дата = Дата;
	ГрафикДежурствМенеджер.Прочитать();
	Возврат ГрафикДежурствМенеджер.Сотрудник;
КонецФункции

//Проверка на то, что дежурство сверхурочное
//Возвращает сотрудника, если дежурство сверхурочное
Функция СверхурочноеДежурство(Дата) Экспорт
	ГрафикДежурствМенеджер = РегистрыСведений.ГрафикДежурств.СоздатьМенеджерЗаписи();
	ГрафикДежурствМенеджер.Дата = Дата;
	ГрафикДежурствМенеджер.Прочитать();
	Если ГрафикДежурствМенеджер.Выбран() Тогда
		Возврат ?(ГрафикДежурствМенеджер.Сверхурочка,ГрафикДежурствМенеджер.Сотрудник,Неопределено);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
